"""
memhack.utils  – terminal colour, banner, shared helpers
"""

from enum import Enum


class Colour(Enum):
    RED    = "\033[91m"
    GREEN  = "\033[92m"
    YELLOW = "\033[93m"
    CYAN   = "\033[96m"
    WHITE  = "\033[97m"
    RESET  = "\033[0m"


def colour(text: str, c: Colour) -> str:
    return f"{c.value}{text}{Colour.RESET.value}"


BANNER = r"""
 ███╗   ███╗███████╗███╗   ███╗██╗  ██╗ █████╗  ██████╗██╗  ██╗
 ████╗ ████║██╔════╝████╗ ████║██║  ██║██╔══██╗██╔════╝██║ ██╔╝
 ██╔████╔██║█████╗  ██╔████╔██║███████║███████║██║     █████╔╝ 
 ██║╚██╔╝██║██╔══╝  ██║╚██╔╝██║██╔══██║██╔══██║██║     ██╔═██╗ 
 ██║ ╚═╝ ██║███████╗██║ ╚═╝ ██║██║  ██║██║  ██║╚██████╗██║  ██╗
 ╚═╝     ╚═╝╚══════╝╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝
          Dynamic C/C++ Vulnerability Analysis Tool  v1.0.0
"""


def banner():
    print(colour(BANNER, Colour.CYAN))
